app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `userName` = '123'
 LIMIT 1
---
    public function login()
    {
		$this->session->setFlashdata('message', '');
		$userModel = new \App\Models\UsersModel();

		// set data
		$data = array(
			'ipAddress'		=> $this->request->getIPAddress(),
			'getBrowser'	=> $this->getBrowser()
		);

		// set post
		$user = $this->request->getPostGet('txtuser');
		$pass = $this->request->getPostGet('txtpassword');

		try {

			if ( $user AND $pass ) {
				$passHash = hash("sha256", $pass);
				// Cek apakah user telah menginput username dan password
				$checkUser = $userModel->where( array("userName" => $user) )->first();

UPDATE `users` SET `lastLogin` = '2022-08-12 15:43:07', `updateDate` = '2022-08-12 15:43:07'
WHERE `users`.`userId` IN ('u100004')
---
					$paramLogin = array(
						'lastLogin'	=> date('Y-m-d H:i:s'),
					);
					$userModel->update(array("userId" => $checkUser->userId), $paramLogin);