app/Controllers/Home.php

    public function index()
    {
		// helper
		Helper('web');

		// model
		$menuModel = new \App\Models\MenuModel();

		// library
		// $perm = new Perm(); // create an instance of Library
		$perm = new \App\Libraries\Perm;

		$boxMenu = "";

		$getMenu = $menuModel->where( array("statusId" => 1, "menuLevel" => 2) )->orderBy("menuOrder", "asc")->findAll();
		foreach ($getMenu as $menu) {
			if ( $perm->role($menu->menuId, 'view') ) {
				$boxMenu .= "<div title='" . $menu->title . "' style='padding:10px'>";
					$getMenuChild = $menuModel->where( array("menuPid" => $menu->menuId, "statusId" => 1) )->orderBy('menuOrder', 'asc')->findAll();
---
SELECT *
FROM `menu`
WHERE `menuPid` = '2'
AND `statusId` = 1
ORDER BY `menuOrder` ASC