app/Controllers/Menu.php

	public function manage()
    {
		// get model table
		$menuTypeModel = new \App\Models\MenuTypeModel();
		$getMenu = $menuTypeModel->findAll();
---
SELECT *
FROM `menuType`

	public function editMenu($id)
	{
		// get model table
		$menuModel = new \App\Models\MenuModel();
		$data = array(
			'menu'		=> @$menuModel->where(array('menuId' => $id))->first()
		);
---
SELECT *
FROM `menu`
WHERE `menuId` = '31'
 LIMIT 1

	public function onloadMenu($type = 'menu-primary')
	{
		$menuTypeModel = new \App\Models\MenuTypeModel();

		$type = urldecode(str_replace('-', ' ', $type));

		$data['menu_type']	= @$menuTypeModel->where(array('type' => $type))->first()->menuTypeId;	//@$this->db->get_where('menu_type', array('type' => $type))->row()->menuTypeId;
---
SELECT *
FROM `menuType`
WHERE `type` = 'menu primary'
 LIMIT 1